benchmarks/lora/definitive_results/results_extras/extract_max_achievable_throughput/llama-3.1-8b-instruct/_/log_26601442.out
INFO 09-04 16:43:51 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='openai', base_url=None, host='localhost', port=29797, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/gpfs/scratch/bsc98/bsc098069/experiment_data/llm_benchmarking/data/ShareGPT_V3_unfiltered_cleaned_split.json', model='/gpfs/scratch/bsc98/bsc098069/experiment_data/llm_benchmarking/models/llama/llama-3.1-8b-instruct', tokenizer=None, num_prompts=8192, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, request_rate=inf, request_rate_by_lora=None, seed=0, trust_remote_code=False, disable_tqdm=False, save_result=True, metadata=None, result_dir='benchmarks/lora/definitive_results/finding_maximum/extract_max_achievable_throughput/llama-3.1-8b-instruct/_', launch_server=True, server_args='--port=29797 --disable-log-requests --model="/gpfs/scratch/bsc98/bsc098069/experiment_data/llm_benchmarking/models/llama/llama-3.1-8b-instruct" --max-num-seqs="2048" --scheduler-cls="vllm.v1.core.sched.scheduler.Scheduler" --no-enable-prefix-caching', server_init_time=1800, disable_log_stats=False, disable_loras_users=True, user_lora_request_relation=None, restrict_loras=None, lora_pre_loading=False, use_synthetic_dataset=None, synthetic_input_length=None, synthetic_output_length=None)
Server started
Starting initial single prompt test run for base model
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     8192      
Benchmark duration (s):                  193.04    
Total input tokens:                      1806849   
Total generated tokens:                  1632047   
Request throughput (req/s):              42.44     
Input token throughput (tok/s):          9360.03   
Output token throughput (tok/s):         8454.50   
---------------Time to First Token----------------
Mean TTFT (ms):                          76510.78  
Median TTFT (ms):                        74514.66  
P99 TTFT (ms):                           155453.85 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          84.81     
Median TPOT (ms):                        87.81     
P99 TPOT (ms):                           106.93    
---------------Inter-token Latency----------------
Mean ITL (ms):                           82.53     
Median ITL (ms):                         86.23     
P99 ITL (ms):                            117.47    
==================================================
Concurrent checker terminated
Server terminated